In [2]:
import pandas as pd

In [ ]:
a = [1, 7, 2]
myvar = pd.Series(a, index=["x", "y", "z"])

In [20]:
myvar["z"]

np.int64(2)

In [25]:
calories = {"day1": 420, "day2": 380, "day3": 390}
cal = pd.Series(calories, index=["day1", "day2", "day3"])
cal

day1    420
day2    380
day3    390
dtype: int64

### DATAFRAME

In [33]:
employee = {
    "name": ["muns", "ali"],
    "salary": [1234, 3214]
}

df = pd.DataFrame(employee)
df

   name  salary
0  muns    1234
1   ali    3214

In [37]:
df.loc[1]

name       ali
salary    3214
Name: 1, dtype: object

In [43]:
df.loc[[1, 0]]

   name  salary
1   ali    3214
0  muns    1234

In [52]:
new = df["salary"]*2
df["Bonus"] = new
df

   name  salary  Bonus
0  muns    1234   2468
1   ali    3214   6428

In [56]:
df = df.assign(Age = [10, 23])
df

   name  salary  Bonus  Age
0  muns    1234   2468   10
1   ali    3214   6428   23